app/controllers/orders_controller.rb

  def create
    @order = Order.new(order_params)
	  if @order.save
---
INSERT INTO `orders` (`created_at`, `customer_last_name`, `customer_name`, `payment_method`, `shipping_address`, `shipping_city`, `status`, `updated_at`) VALUES ('2014-03-11 21:33:09', '1', '1', '1', '1', '1', '1', '2014-03-11 21:33:09')

  def edit
    @order = Order.find(params[:id])
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1

  def update
    @order = Order.find(params[:id])

    if @order.update(order_params)
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1
UPDATE `orders` SET `customer_last_name` = '12', `updated_at` = '2014-03-11 21:48:48' WHERE `orders`.`id` = 1

  def destroy
    @order = Order.find(params[:id])
    @order.destroy
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 2 LIMIT 1
DELETE FROM `orders` WHERE `orders`.`id` = 2