app/controllers/products_controller.rb

INSERT INTO `products` (`created_at`, `description`, `manufacturer`, `name`, `registered_at`, `stock`, `updated_at`) VALUES ('2014-03-01 17:12:11', '2', '2', '222', '2014-03-01 17:11:00', 2, '2014-03-01 17:12:11')
---
	def create
		@product = Product.new(product_params)
		if @product.save

SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
UPDATE `products` SET `name` = '111', `registered_at` = '2014-03-01 17:12:00', `updated_at` = '2014-03-01 17:15:11' WHERE `products`.`id` = 1
---
	def update
	  @product = Product.find(params[:id])

	  if @product.update(product_params)